In [5]:
import pandas as pd
import numpy as np

In [13]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [12]:
labels = pd.Index(np.arange(3))
obj2 = pd.Series([1.5, -2.4, 0], index=labels)
obj2.index is labels

True

Unlike Python sets, a pandas Index can contain duplicate labels:

In [15]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### essential functionality

reindexing

In [17]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [19]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [22]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [47]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a', 'b', 'c'],columns=['Ohio', 'Texas', 'California'])
print(frame)
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
print(frame2)

states = ['Texas', 'Utah', 'California']
frame3 = frame.reindex(columns=states)
print(frame3)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN
   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

### drop entries

In [29]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [30]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [31]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [48]:
frame2.drop(['Ohio'], axis=1, inplace=True)
frame2

   Texas  California
a    1.0         2.0
b    4.0         5.0
c    7.0         8.0
d    NaN         NaN

In [49]:
 data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [50]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [51]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [53]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [54]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [60]:
print(data)
print(data.three)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

###  Arithmetic and Data Alignment

In [70]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print(df1) 
print(df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [71]:
print((df1 + df2).index)
print(df1 + df2)

Index(['Colorado', 'Ohio', 'Oregon', 'Texas', 'Utah'], dtype='object')
            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [73]:
df1.reindex(columns=df2.columns, fill_value=0)

            b    d  e
Ohio      0.0  2.0  0
Texas     3.0  5.0  0
Colorado  6.0  8.0  0

### oprerations between dataframe and series

In [77]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),\
                                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [83]:
series = frame.iloc[0]
print(frame)
print(series)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [86]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

Function Application and Mapping

In [89]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),\
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.058759 -1.424299 -0.319579
Ohio   -0.429545  1.667555 -0.416372
Texas  -0.020142 -0.882689  0.153884
Oregon  0.369275  0.626983 -0.170766

In [90]:
np.abs(frame)

               b         d         e
Utah    0.058759  1.424299  0.319579
Ohio    0.429545  1.667555  0.416372
Texas   0.020142  0.882689  0.153884
Oregon  0.369275  0.626983  0.170766

In [94]:
f = lambda x: x.max() - x.min()
print(frame.apply(f))
print(frame.apply(f, axis=1))
print(frame.apply(f, axis='columns'))

b    0.798819
d    3.091855
e    0.570256
dtype: float64
Utah      1.483059
Ohio      2.097100
Texas     1.036574
Oregon    0.797749
dtype: float64
Utah      1.483059
Ohio      2.097100
Texas     1.036574
Oregon    0.797749
dtype: float64

In [97]:
format = lambda x: '%.2f' % x
print(frame.applymap(format))
print(frame['e'].map(format))

            b      d      e
Utah     0.06  -1.42  -0.32
Ohio    -0.43   1.67  -0.42
Texas   -0.02  -0.88   0.15
Oregon   0.37   0.63  -0.17
Utah      -0.32
Ohio      -0.42
Texas      0.15
Oregon    -0.17
Name: e, dtype: object